var trans = ["二","基本的","權利","在","的","我們","憲法","是","找到","在","的","第十四","修正","所致","處理","和","等於","保護","的","所致","處理","規定","保護","人","從","存在","被剝奪","的","生活","自由","要么","屬性","沒有","所致","處理","的","法","和","的","規定","去","上","至","給","的","腳步","那","必須","是","緊隨其後","至","使","當然","的","處理","是","從根本上","公平","一個","處理","是","考慮","至","是","從根本上","公平","如果","那裡","具有","過","所致","注意","一個","聽力","一個","偏見","事實","發現者","的","機會","至","當下","證據","和","至","交叉","檢查","目擊者","和","的","對","的","上訴","下","的","等於","保護","規定","沒有","人","可能","是","否認","等於","保護","下","的","法律","等於","保護","確實","不","禁止","所有","差異","在","的","辦法","人","是","治療","但","它","需要","那","這些","差異","是","合理","對於","案例","涉及","的","控制","的","不同的","企業","和","對於","普通","案件","等於","保護","是","相當","疏鬆","然而","什麼時候","分類","這樣","如","種族","宗教","要么","國民","少數民族","是","參與","然後","的","等於","保護","是","強制執行","許多","更多","嚴格","這個","是","也","真正","什麼時候","基本","權利","是","參與","基本","權利","是","表決","婚姻","隱私","訪問","至","一個","法庭","如果","一","是","所需","和","旅行","之間","的","狀態","在","這些","案件","的","對","的","的","政府","至","對待","人","不同","下","的","法","是","非常","有限","由於","處理","和","等於","保護","應用","都","至","個人","和","至","企業","雖然","業務","可能","似乎","至","是","不同","從","個人","的","法","通常","對待","一個","註冊","商業","如","一個","人"]
var n = 244;
$(document).ready(function(){
  var p = $('#article');
  var text = p.text().split(' ');
  for(var i = 0, len = text.length; i < len; i=i+1) {
      text[i] = '<div class="parent" onMouseOver="add(\'div'+i+'\')" onMouseOut="hide(\'div'+i+'\')">'+text[i]+'<div class="child" id="div'+i+'">'+trans[i]+'</div> </div>'
  }
  p.html(text.join(' '));

});

var times = Array.apply(null, Array(n)).map(Number.prototype.valueOf,0);
var timer;
var focustime = 1000;
function add(id_str) {
  var sub = id_str.substring(3, 6);
  var id = parseInt(sub, 10);
  times[id] += 1;
  console.log("word"+id+": "+times[id]);
  if (times[id]) {
    timer = setTimeout(function() {
      document.getElementById(id_str).style.visibility = "visible";
    }, focustime);
  }
}
function hide(id_str) {
  clearTimeout(timer);
  document.getElementById(id_str).style.visibility = "hidden";
}

