var trans = ["民主", "機構", "是", "設備", "對於", "調和", "社會", "訂購", "用", "個人", "自由", "和", "倡議", "和", "對於", "製造", "的", "即時", "功率", "的", "一個", "國家的", "統治者", "學科", "至", "的", "最終", "功率", "的", "的", "排除", "的", "事實", "那", "在", "西", "歐洲", "和", "美國", "這些", "設備", "有", "工作", "所有", "的東西", "深思熟慮", "不", "太", "厲害", "是", "證明", "足夠", "那", "的", "第十八", "世紀", "樂觀主義者", "當中", "不", "完全", "錯誤", "給出", "一個", "公平", "機會", "一世", "重複", "對於", "的", "公平", "機會", "是", "一個", "不可缺少", "前提", "沒有", "人", "那", "通過", "突然", "從", "一個", "州", "的", "屈從", "下", "的", "規則", "的", "一個", "暴君", "至", "的", "徹底", "陌生", "州", "的", "政治", "獨立", "能夠", "是", "說", "至", "有", "一個", "公平", "機會", "的", "存在", "能夠", "至", "治理", "本身", "民主", "自由主義", "一夜暴富", "在", "一個", "大氣層", "的", "繁榮", "和", "下降", "如", "下降", "繁榮", "令", "它", "必要", "對於", "的", "政府", "至", "干預", "永遠", "更多", "經常", "和", "急劇下降", "在", "的", "事務", "的", "它的", "科目", "人口過多", "和", "過組織", "是", "二", "條件", "哪一個", "剝奪", "一個", "社會", "的", "一個", "公平", "機會", "的", "製造", "民主的", "機構", "工作", "有效", "我們", "看到", "然後", "那", "那裡", "是", "某些", "歷史", "經濟", "人口", "和", "技術", "條件", "哪一個", "使", "它", "非常", "硬", "對於", "杰弗森的", "合理的", "動物", "賦", "通過", "性質", "用", "不可剝奪的", "權利", "和", "一個", "先天", "感", "的", "正義", "至", "行使", "其", "原因", "要求", "其", "權利", "和", "法案", "公正", "中", "一個", "民主", "主辦", "社會", "我們", "在", "的", "西", "有", "過", "千鈞", "幸運", "在", "有", "過", "給出", "一個", "公平", "機會", "的", "製造", "的", "大", "實驗", "在", "自治", "不幸", "它", "現在", "看起來", "如", "雖然", "虧欠的", "至", "最近", "變化", "在", "我們的", "情況", "這個", "無限", "珍貴", "公平", "機會", "當中", "存在", "小", "通過", "小", "拍攝", "遠", "從", "我們"]
var n = 264;
$(document).ready(function(){
  var p = $('#article');
  var text = p.text().split(' ');
  for(var i = 0, len = text.length; i < len; i=i+1) {
      text[i] = '<div class="parent" onMouseOver="add(\'div'+i+'\')" onMouseOut="hide(\'div'+i+'\')">'+text[i]+'<div class="child" id="div'+i+'">'+trans[i]+'</div> </div>'
  }
  p.html(text.join(' '));

});

var times = Array.apply(null, Array(n)).map(Number.prototype.valueOf,0);
var timer;
var focustime = 1000;
function add(id_str) {
  var sub = id_str.substring(3, 6);
  var id = parseInt(sub, 10);
  times[id] += 1;
  console.log("word"+id+": "+times[id]);
  if (times[id]) {
    timer = setTimeout(function() {
      document.getElementById(id_str).style.visibility = "visible";
    }, focustime);
  }
}
function hide(id_str) {
  clearTimeout(timer);
  document.getElementById(id_str).style.visibility = "hidden";
}

