var trans = ["該", "新", "經濟", "具有", "創建", "大", "商業", "機會", "如", "好", "如", "大", "動盪", "不", "以來", "該", "產業", "革命", "有", "該", "賭注", "的", "交易", "同", "更改", "一直", "所以", "高", "最", "傳統", "組織", "有", "公認", "在", "理論", "在", "最小", "那", "他們", "必須", "使", "重大的", "變化", "甚至", "大", "新", "公司", "認識", "那", "他們", "需要", "至", "管理", "該", "變化", "關聯", "同", "快速", "創業", "增長", "儘管", "一些", "個人", "成功", "然而", "這個", "遺跡", "難", "和", "少數", "公司", "管理", "該", "處理", "如", "好", "如", "他們", "將", "喜歡", "最", "公司", "有", "開始", "通過", "安裝", "新", "技術", "減員", "重組", "要么", "試", "至", "更改", "企業", "文化", "和", "最", "有", "有", "低", "成功", "率", "關於", "70", "百分", "的", "所有", "更改", "舉措", "失敗", "該", "原因", "對於", "最", "的", "這些", "故障", "是", "那", "在", "其", "搶", "至", "更改", "其", "組織", "經理", "成為", "如醉如痴", "通過", "所有", "該", "不同", "和", "有時", "相互矛盾的", "忠告", "他們", "接收", "關於", "為什麼", "公司", "應該", "更改", "什麼", "他們", "應該", "嘗試", "至", "完成", "和", "怎麼樣", "他們", "應該", "做", "它", "該", "結果", "是", "那", "他們", "失去", "焦點", "和", "失敗", "至", "考慮", "什麼", "將", "工作", "最好", "對於", "其", "擁有", "公司", "至", "提高", "該", "可能性", "的", "成功", "它", "是", "勢在必行", "那", "高管", "理解", "該", "性質", "和", "處理", "的", "企業", "更改", "許多", "更好", "最", "公司", "使用", "一個", "混合", "的", "都", "硬", "和", "柔軟的", "更改", "策略", "硬", "更改", "結果", "在", "激烈", "裁員", "減員", "和", "重組", "柔軟的", "更改", "是", "基於", "上", "內部", "組織", "變化", "和", "該", "漸進", "發展", "的", "一個", "新", "企業", "文化", "通過", "個人", "和", "組織", "學習", "都", "策略", "可能", "是", "成功", "但", "它", "是", "難", "至", "結合", "他們", "有效", "公司", "那", "是", "能夠", "至", "做", "這個", "能夠", "收割", "重大", "收益", "在", "生產力", "和", "盈利能力"]

$(document).ready(function(){
  var p = $('#article');
  var text = p.text().split(' ');
  for(var i = 0, len = text.length; i < len; i=i+1) {
      text[i] = '<div class="parent" onMouseOver="add(\'div'+i+'\')" onMouseOut="hide(\'div'+i+'\')">'+text[i]+'<div class="child" id="div'+i+'">'+trans[i]+'</div> </div>'
  }
  p.html(text.join(' '));

});

var times = Array.apply(null, Array(268)).map(Number.prototype.valueOf,0);
var timer;
var focustime = 00;
function add(id_str) {
  var sub = id_str.substring(3, 6);
  var id = parseInt(sub, 10);
  times[id] += 1;
  console.log("word"+id+": "+times[id]);
  if (times[id]) {
    timer = setTimeout(function() {
      document.getElementById(id_str).style.visibility = "visible";
    }, focustime);
  }
}
function hide(id_str) {
  clearTimeout(timer);
  document.getElementById(id_str).style.visibility = "hidden";
}

