var trans = ["美國","線上","是","一","的","的","大","名","上","的","互聯網","和","不像","許多","其他","數字","公司","它","其實","令","一個","利潤","但是","的","公司","哪一個","它的","對手","呼叫","的","網絡蟑螂","了","推出","只要","在","1992年","之前","那","它","了","一個","小","公司","調用","控制","視頻","公司","和","它","製作","視頻","遊戲","然後","史蒂夫","案件","一個","前任的","比薩","小屋","營銷","行政人員","到達","和","拿了","的","公司","網上","創新","快速","移動","和","用戶友好","美國","線上","上訴","至","人","誰","想","至","衝浪","的","互聯網","但","誰","做","不","有","一個","許多","的","體驗","對於","的","相同","原因","技術人員","人","誰","認為","他們","是","更多","專家","用","電腦","看","下","上","美國","線上","和","它的","用戶","最近","美國","線上","或者","AOL","作為","它","電話","本身）","加盟","用","時間","華納"," - ","一個","數百萬","美元","電影","和","雜誌","公司"," - ","至","創建","一個","多媒體","巨大的","現在"," AOL","具有","開始了","至","擴大","在國外","在","許多","歐洲","國家","包含","的","聯合的","王國","它","是","硬","至","購買","一個","電腦","雜誌","那","確實","不","有","一個","自由"," AOL","介紹","提供","本","公司","也","放","廣告","到","的","電視","和","員工","人","至","手","出","它的","自由","介紹","磁盤","在","場所","喜歡","培養","站","作為","的","互聯網","得到","快點"," AOL","是","不斷變化的","隨著","許多","家園","得到","高速","連接","通過","纖維","視神經","電纜","要么","的","新"," ASDL","技術","的","網絡蟑螂","將","有","至","顯示","那","喜歡","真實","蟑螂 ","它","能夠","生存","在","差不多","任何","環境"]
var n = 237;
$(document).ready(function(){
  var p = $('#article');
  var text = p.text().split(' ');
  for(var i = 0, len = text.length; i < len; i=i+1) {
      text[i] = '<div class="parent" onMouseOver="add(\'div'+i+'\')" onMouseOut="hide(\'div'+i+'\')">'+text[i]+'<div class="child" id="div'+i+'">'+trans[i]+'</div> </div>'
  }
  p.html(text.join(' '));

});

var times = Array.apply(null, Array(n)).map(Number.prototype.valueOf,0);
var timer;
var focustime = 1000;
function add(id_str) {
  var sub = id_str.substring(3, 6);
  var id = parseInt(sub, 10);
  times[id] += 1;
  console.log("word"+id+": "+times[id]);
  if (times[id]) {
    timer = setTimeout(function() {
      document.getElementById(id_str).style.visibility = "visible";
    }, focustime);
  }
}
function hide(id_str) {
  clearTimeout(timer);
  document.getElementById(id_str).style.visibility = "hidden";
}

