var trans = ["約瑟夫", "普利策獎", "了", "誕生", "在", "1847年", "在", "MAKO", "匈牙利", "他", "移民", "至", "的", "聯合的", "狀態", "什麼時候", "他", "了", "十七", "年份", "舊", "和", "了", "歸", "上", "他的", "第二十", "生日", "他", "花費", "他的", "事業", "在", "新聞", "加工", "在", "裡面", "中西部", "和", "新", "紐約", "從", "1871年", "他", "了", "也", "的", "所有者", "要么", "部分業主", "的", "許多", "報紙", "他的", "最", "著名", "報紙", "了", "的", "新", "約克", "世界", "其中", "很多的", "信", "了", "在", "模型", "在", "該", "每日", "星球", "的", "該", "超人", "故事", "本", "世界", "競選", "反對", "腐敗", "和", "裸露", "許多", "醜聞", "它", "了", "也", "一個", "強大", "支持者", "的", "的", "權利", "的", "的", "加工", "人", "在", "後來", "生活", "約瑟夫", "普利策獎", "崩潰了", "從", "過度勞累", "和", "丟失", "他的", "視線", "他", "成了", "專用", "至", "日臻完善", "的", "質量", "的", "新聞", "在", "美國", "和", "捐贈的", "$ 1", "百萬", "至", "哥倫比亞", "大學", "至", "找到", "一個", "學校", "的", "新聞", "然而", "他的", "最", "重大", "貢獻", "了", "的", "建立", "的", "的", "普利策獎", "獎品", "在", "他的", "會", "這些", "獎品", "對於", "卓越", "在", "新聞", "有", "過", "給出", "每一個", "年", "以來", "1917年", "通過", "哥倫比亞", "大學", "自", "1942年", "在那裡", "有", "過", "額外", "類別", "對於", "按", "攝影", "和", "後來", "仍然", "對於", "批評", "特徵", "寫作", "和", "解說", "本", "獎", "了", "本來", "對於", " $ 500", "但", "今天", "的", "贏家", "的", "的", "獎", "接收", "一個", "金", "金牌", "不過", "的", "真實", "值", "的", "的", "獎", "是", "那", "它", "印證", "那", "的", "記者", "誰", "具有", "好評", "的", "獎", "是", "的", "最好", "美國人", "記者", "的", "的", "年", " - ", "一個", "事實", "那", "是", "價值", "許多", "更多", "比", " $ 500元", "至", "的", "記者", "和", "至", "的", "報紙", "那", "員工", "他", "要么", "她"]
var n = 257;
$(document).ready(function(){
  var p = $('#article');
  var text = p.text().split(' ');
  for(var i = 0, len = text.length; i < len; i=i+1) {
      text[i] = '<div class="parent" onMouseOver="add(\'div'+i+'\')" onMouseOut="hide(\'div'+i+'\')">'+text[i]+'<div class="child" id="div'+i+'">'+trans[i]+'</div> </div>'
  }
  p.html(text.join(' '));

});

var times = Array.apply(null, Array(n)).map(Number.prototype.valueOf,0);
var timer;
var focustime = 1000;
function add(id_str) {
  var sub = id_str.substring(3, 6);
  var id = parseInt(sub, 10);
  times[id] += 1;
  console.log("word"+id+": "+times[id]);
  if (times[id]) {
    timer = setTimeout(function() {
      document.getElementById(id_str).style.visibility = "visible";
    }, focustime);
  }
}
function hide(id_str) {
  clearTimeout(timer);
  document.getElementById(id_str).style.visibility = "hidden";
}

